// Файл: progr21_01_06_demo.cpp
// От упр-е 1 по Програмиране (C++) със спец. Инф., ред., 1 курс
#include <iostream>
using namespace std;
int main() {
  double d2 = 45.4545, d = 12.098;
  cout << "d = " << d << endl;
  d = d + 10;
  cout << "d = " << d << endl;
  double *u; // декларация на указател
  u = &d; // насочване на указател към данна; &d е указател към d
  *u = *u + 10; // назоваване на данна, сочена от указател
  cout << "d  = " << d << endl;
  cout << "*u = " << *u << endl; // пак назоваване чрез указател
  long long L = (long long) &d2;
    // получаване на адреса (числото), който е част от указател
  cout << "L = " << hex << L << " (16);\n"
       << dec << "&d2 = " << &d2 << " (16)\n";
  cout << endl;
  L -= 8;
  u = (double*) L; // преобразуване на число в указател
  *u = 345678;
  cout << "d  = " << d << endl;
  cout << "*u = " << *u << endl;
  cout << "&d = " << &d << endl;
  cout << "u = " << u << endl;
  cout << endl << "(int)(&d - u) = "
       << (int)(&d - u) << endl; // изваждане на указатели
  cout << "(int)&d - (int)u = "
        << (int)&d - (int)u << endl; // изваждане на цели числа
  cout << "&d - u = "
        << &d - u << endl; // изваждане на указатели
  cout << "(int)(&d2 - u) = "
       << (int)(&d2 - u) << endl; // изваждане на указатели
  cout << "(int)&d2 - (int)u = "
        << (int)&d2 - (int)u << endl; // изваждане на цели числа
  cout << "&d2 - u = "
        << &d2 - u << endl; // изваждане на указатели
  cout << endl << "sizeof(u) = "
       << sizeof(u) << "\n\n"; // памет за стойността на указател
  cout << "изразът &d==u има стойност " << boolalpha
       <<  (&d==u) << endl; // сравняване на указатели
  cout << "изразът &d2>u има стойност " << boolalpha
       <<  (&d2>u) << endl; // сравняване на указатели
  cout << "u = " << u << endl
       << "u+1 = " << u+1 << endl; //сумиране на указател с число
  cout << "изразът &d2 == u+1 има стойност " << boolalpha
       <<  (&d2 == u+1) << endl; // сравняване на указатели
  cout << "изразът &d2 != u+1 има стойност " << boolalpha
       <<  (&d2 != u+1) << endl; // сравняване на указатели
}
