// Денят е кратък работата никога не свършва, а вие сте млади и ентусиазирани студенти, които трябва да си разпределят времето адекватно. 
// Да се създаде приложение за обработка на задачи, тип TODO LIST.

// Task : #1 
// Списъка трябва да съдържа набор от три полета:
// Текстово поле, за въвеждане на заглавието на задачата : Да си напиша домашното
// Падащо меню, за задаване на приоритет : Нисък / Среден / Висок
// Бутон за съхранение на задачата


// Task : #2
// Запазената задача се листва в рамките на списъка, като се визуализира нейното име и приоритета и. Всички задачи се сортират по приоритет.

// Task : #3
// Задачата трябва да може да се селектира. Селектираните задачи биват визуализирани по начин, различен от не селектираните такива. Например, оцветяват се различно, получават специфична цветова рамка или се позиционират на различно място спрямо останалите елементи.

// Task : #4
// Системата разпознава два статуса за задачите в нея.
// * Една задача е в състояние отворена в момента в който е създадена, 
// * Една задача е в състояние финализирана, когато статуса и бъде сменен ръчно от потребителя.

// Task : #5
// Селектираната задача трябва да може да бъде финализирана, Финализираната задача се визуализира, с черта която пресича цялото заглавие на задачата.

// Task : #6
// Селектирана, финализирана задача трябва да може да бъде отваряна отново. 

// Task : #7
// Селектираната задача трябва да може да бъде изтривана. Изтритата задача, се премахва от списъка.

// Task : #8
// Селектирана задача трябва да може да бъде архивирана, архивираните задачи се визуализират в списък, наречен архив

// Task : #9
// Селектирана задача трябва да може да бъде редактирана. Редактираната задача, се визуализира в специфична контрола в рамките на нейната позиция. Една задача може да получи ново заглавие, както и да смени настоящият си приоритет.