//Да се напише програма, която въвежда от клавиатурата 2 числа (цели) a и b и отпечатва на екрана следващите 20 елемента
//от "Ред на Фибоначи", в който всяко следващо число е сума от предишните 2

#include <iostream>
using namespace std;

int main() {
    int a, b, c;
    cout << "Въведете стойности за първи и втори елемент: " << endl;
    cin >> a >> b;
    int i = 0;
    while (i < 20) {
        c = a + b;
        cout << "Fib(" << (i + 2) << ") = " << c << endl;
        a = b;
        b = c;
        i++;
    }
    return 0;
}