// Ние всички обожаваме да играем компютърни игри, да си губим времето с безмислени приключения затънали във виртуалната безметежност. 
// Вие обаче имате идея, ще покорявате нови върхове, виртуалният свят ще трепери пред вашето изобретение. Започвате смело да правите играта на годината. 
// Ще бъде бойна ще има напрежение вие сте Нинджа  и се борите със силите на злото. Концепцията е сложна но вие обичате предизвикателствата. 
// Веднага се впускате в работа и започвате да пишете логиката за създаване на противниците във вашата игричка. 

// Направете миниатюрна версия на случаен генератор на фигури, (вашите противници). 

// Разполагате с Canvas платно с произволни еразмери върху който се генерират фигури отговарящи на следните условия:
// * Генератора трябва да създава фигура с произволни размери. Височина и широчина
// * Генератора трябва да създава фигура с произволен цвят
// * Генератора трябва да създава фигура с произволна начална координатна позиция
// * Генератора трябва за създава фигура с произволна форма (кръг / квадрат)
// * Добавете бутон за начало и бутон за край на играта. При натискането им трябва да се появява съобщение и да се случи необходимото събитие.

// Максимален брой точки от упражнението : 20 (по 4 на условие)

// Бонус условия. 
// * Фигурите не трябва да се застъпват или да се позиционират една под друга
// * Да се добави възможност клиента да избира интервала от време през който да се генерират фигурите

// Максимален брой точки от бонус задачите : 10 (по 5 на условие)


// Проучете : за да генерирате фигурите ви е необходим механизъм за извършване на действия в рамките на определен интервал от време
// проучете функциите setTimeout и setInterval